lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
#include <Arduino.h>
#include <string.h>

#include "nrf54l15_hal.h"
#include "zigbee_commissioning.h"
#include "zigbee_security.h"
#include "zigbee_stack.h"

#if defined(NRF54L15_CLEAN_ZIGBEE_ENABLED) && (NRF54L15_CLEAN_ZIGBEE_ENABLED == 0)
#error "Enable Tools > Zigbee Support to build ZigbeeHaCoordinatorJoinDemo."
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_CHANNEL
#define NRF54L15_CLEAN_ZIGBEE_CHANNEL 15
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_PAN_ID
#define NRF54L15_CLEAN_ZIGBEE_PAN_ID 0x1234
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY
#define NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY 1
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_COORDINATOR_IEEE
#define NRF54L15_CLEAN_ZIGBEE_COORDINATOR_IEEE 0x00124B000054A11FULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_EXTENDED_PAN_ID
#define NRF54L15_CLEAN_ZIGBEE_EXTENDED_PAN_ID 0x00124B000054C0DEULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ONOFF_LIGHT_IEEE
#define NRF54L15_CLEAN_ZIGBEE_ONOFF_LIGHT_IEEE 0x00124B0001AC1001ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ONOFF_LIGHT_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_ONOFF_LIGHT_INSTALL_CODE_BYTES                    \
  0x10U, 0xACU, 0x01U, 0x01U, 0x24U, 0x4BU, 0x00U, 0xA1U, 0xB2U, 0xC3U, 0xD4U, \
      0xE5U, 0xF6U, 0x07U, 0x18U, 0x29U, 0x43U, 0x6AU
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_DIMMABLE_LIGHT_IEEE
#define NRF54L15_CLEAN_ZIGBEE_DIMMABLE_LIGHT_IEEE 0x00124B0001AC1002ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_DIMMABLE_LIGHT_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_DIMMABLE_LIGHT_INSTALL_CODE_BYTES                 \
  0x10U, 0xACU, 0x02U, 0x01U, 0x24U, 0x4BU, 0x00U, 0xAAU, 0xBBU, 0xCCU, 0xDDU, \
      0xEEU, 0xFFU, 0x11U, 0x22U, 0x33U, 0xFEU, 0xC9U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_SENSOR_IEEE
#define NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_SENSOR_IEEE 0x00124B0001AC2001ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_SENSOR_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_SENSOR_INSTALL_CODE_BYTES             \
  0x10U, 0xACU, 0x03U, 0x01U, 0x24U, 0x4BU, 0x00U, 0xCAU, 0xFEU, 0xBAU, 0xBEU, \
      0x10U, 0x21U, 0x32U, 0x43U, 0x54U, 0xDCU, 0xB9U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_REQUIRE_UNIQUE_LINK_KEY_FOR_REJOIN
#define NRF54L15_CLEAN_ZIGBEE_REQUIRE_UNIQUE_LINK_KEY_FOR_REJOIN 1
#endif

using namespace xiao_nrf54l15;

namespace {

static ZigbeeRadio g_radio;
static uint8_t g_macSequence = 1U;
static uint8_t g_nwkSequence = 1U;
static uint32_t g_nwkSecurityFrameCounter = 1U;
static uint32_t g_apsTrustCenterFrameCounter = 1U;
static uint8_t g_apsCounter = 1U;
static uint8_t g_zclSequence = 1U;
static uint8_t g_zdoSequence = 1U;
static uint32_t g_lastBeaconMs = 0U;
static uint32_t g_lastStatusMs = 0U;
static uint32_t g_permitJoinDeadlineMs = 0U;
static bool g_permitJoinEnabled = true;

static constexpr uint8_t kChannel =
    static_cast<uint8_t>(NRF54L15_CLEAN_ZIGBEE_CHANNEL);
static constexpr uint16_t kPanId =
    static_cast<uint16_t>(NRF54L15_CLEAN_ZIGBEE_PAN_ID);
static constexpr uint16_t kCoordinatorShort = 0x0000U;
static constexpr uint8_t kCoordinatorEndpoint = 1U;
static constexpr uint64_t kCoordinatorIeee =
    static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_COORDINATOR_IEEE);
static constexpr uint64_t kExtendedPanId =
    static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_EXTENDED_PAN_ID);
static uint8_t g_activeNetworkKeySequence = 0x01U;
static uint8_t g_activeNetworkKey[16] = {0xA1U, 0xB2U, 0xC3U, 0xD4U,
                                         0xE5U, 0xF6U, 0x07U, 0x18U,
                                         0x29U, 0x3AU, 0x4BU, 0x5CU,
                                         0x6DU, 0x7EU, 0x8FU, 0x90U};
static uint8_t g_alternateNetworkKeySequence = 0U;
static uint8_t g_alternateNetworkKey[16] = {0U};
static bool g_haveAlternateNetworkKey = false;
static constexpr uint8_t kMaxNodes = 8U;
static constexpr uint8_t kPendingPayloadMax = 96U;
static constexpr uint8_t kZclCommandWriteAttributesResponse = 0x04U;
static constexpr uint8_t kZclCommandConfigureReportingResponse = 0x07U;
static constexpr uint8_t kZclCommandReadReportingConfigurationResponse = 0x09U;
static constexpr uint8_t kZclCommandReportAttributes = 0x0AU;
static constexpr uint8_t kZclCommandDefaultResponse = 0x0BU;
static constexpr uint8_t kZclCommandDiscoverAttributesExtendedResponse = 0x16U;
static constexpr uint8_t kOnOffCommandOff = 0x00U;
static constexpr uint8_t kOnOffCommandOn = 0x01U;
static constexpr uint8_t kOnOffCommandToggle = 0x02U;
static constexpr uint8_t kIdentifyCommandIdentify = 0x00U;
static constexpr uint8_t kIdentifyCommandIdentifyQuery = 0x01U;
static constexpr uint8_t kIdentifyCommandTriggerEffect = 0x40U;
static constexpr uint8_t kIdentifyEffectBlink = 0x00U;
static constexpr uint8_t kIdentifyEffectBreathe = 0x01U;
static constexpr uint8_t kIdentifyEffectChannelChange = 0x0BU;
static constexpr uint8_t kIdentifyEffectStopEffect = 0xFFU;
static constexpr uint8_t kGroupsCommandAddGroup = 0x00U;
static constexpr uint8_t kLevelControlCommandMoveToLevelWithOnOff = 0x04U;
static constexpr uint8_t kLevelControlCommandStepWithOnOff = 0x06U;
static constexpr uint16_t kDemoGroupId = 0x1001U;
static constexpr uint32_t kPermitJoinWindowMs = 120000UL;

struct PreconfiguredNodePolicy {
  uint64_t ieeeAddress;
  uint8_t installCode[18];
};

static const PreconfiguredNodePolicy kPreconfiguredNodePolicies[] = {
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_ONOFF_LIGHT_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_ONOFF_LIGHT_INSTALL_CODE_BYTES}},
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_DIMMABLE_LIGHT_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_DIMMABLE_LIGHT_INSTALL_CODE_BYTES}},
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_SENSOR_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_SENSOR_INSTALL_CODE_BYTES}},
};

enum class NodeStage : uint8_t {
  kIdle = 0U,
  kAwaitingNodeDescriptor = 1U,
  kAwaitingPowerDescriptor = 2U,
  kAwaitingActiveEndpoints = 3U,
  kAwaitingSimpleDescriptor = 4U,
  kAwaitingBasicRead = 5U,
  kAwaitingReporting = 6U,
  kReady = 7U,
};

enum class TrustCenterNodeState : uint8_t {
  kIdle = 0U,
  kWaitingTransportKey = 1U,
  kJoined = 2U,
  kWaitingUpdateDevice = 3U,
  kAlternateKeyStaged = 4U,
};

struct PendingApsFrame {
  bool used = false;
  uint8_t deliveryMode = kZigbeeApsDeliveryUnicast;
  uint16_t destinationGroup = 0U;
  uint16_t clusterId = 0U;
  uint16_t profileId = 0U;
  uint8_t destinationEndpoint = 0U;
  uint8_t sourceEndpoint = 0U;
  uint8_t payloadLength = 0U;
  uint8_t payload[kPendingPayloadMax] = {0U};
};

