lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
struct PendingApsAck {
  bool active = false;
  uint8_t counter = 0U;
  uint16_t clusterId = 0U;
  uint16_t profileId = 0U;
  uint8_t destinationEndpoint = 0U;
  uint8_t sourceEndpoint = 0U;
  uint8_t retriesRemaining = 0U;
  uint32_t deadlineMs = 0U;
  PendingApsFrame frame{};
};

struct RecentInboundAps {
  bool valid = false;
  uint8_t counter = 0U;
  uint16_t clusterId = 0U;
  uint16_t profileId = 0U;
  uint8_t destinationEndpoint = 0U;
  uint8_t sourceEndpoint = 0U;
  uint8_t deliveryMode = 0U;
  uint32_t expiresMs = 0U;
};

static constexpr uint8_t kPendingApsAckSlots = 3U;
static constexpr size_t kNodeTextMax = 33U;

struct NodeEntry {
  bool used = false;
  uint64_t ieeeAddress = 0U;
  uint16_t shortAddress = 0U;
  uint32_t lastSeenMs = 0U;
  bool secureNwkSeen = false;
  uint32_t lastInboundSecurityFrameCounter = 0U;
  uint8_t currentNetworkKeySequence = 0U;
  bool pendingTransportKey = false;
  bool pendingNetworkKeyUpdate = false;
  bool pendingSwitchKey = false;
  bool pendingLeaveWithRejoin = false;
  bool pendingSecureRejoin = false;
  bool pendingAssociationResponse = false;
  uint16_t pendingAssignedShort = 0U;
  uint8_t pendingAssociationStatus = 0U;
  PendingApsFrame pending{};
  PendingApsAck pendingApsAcks[kPendingApsAckSlots]{};
  RecentInboundAps recentInboundAps{};
  bool announced = false;
  bool haveNodeDescriptor = false;
  uint8_t logicalType = 0U;
  uint8_t macCapabilityFlags = 0U;
  uint16_t manufacturerCode = 0U;
  bool havePowerDescriptor = false;
  uint8_t availablePowerSources = 0U;
  uint8_t currentPowerSource = 0U;
  uint8_t currentPowerSourceLevel = 0U;
  bool haveBasicZclVersion = false;
  uint8_t basicZclVersion = 0U;
  bool haveBasicApplicationVersion = false;
  uint8_t basicApplicationVersion = 0U;
  bool haveBasicStackVersion = false;
  uint8_t basicStackVersion = 0U;
  bool haveBasicHwVersion = false;
  uint8_t basicHwVersion = 0U;
  bool haveBasicPowerSource = false;
  uint8_t basicPowerSource = 0U;
  char basicManufacturerName[kNodeTextMax] = {0};
  char basicModelIdentifier[kNodeTextMax] = {0};
  char basicSwBuildId[kNodeTextMax] = {0};
  uint8_t endpoint = 0U;
  uint16_t profileId = 0U;
  uint16_t deviceId = 0U;
  bool supportsOnOff = false;
  bool supportsLevelControl = false;
  bool supportsIdentify = false;
  bool supportsTemperature = false;
  bool supportsPowerConfiguration = false;
  bool haveIdentifyTime = false;
  uint16_t identifyTimeSeconds = 0U;
  bool basicRead = false;
  bool onOffBindingConfigured = false;
  bool levelBindingConfigured = false;
  bool temperatureBindingConfigured = false;
  bool powerBindingConfigured = false;
  bool onOffReportingConfigured = false;
  bool levelReportingConfigured = false;
  bool temperatureReportingConfigured = false;
  bool powerReportingConfigured = false;
  bool onOffReportingVerified = false;
  bool levelReportingVerified = false;
  bool temperatureReportingVerified = false;
  bool powerReportingVerified = false;
  bool awaitingBindResponse = false;
  uint16_t awaitingClusterId = 0U;
  bool haveOnOffState = false;
  bool onOffState = false;
  bool haveLevelState = false;
  uint8_t levelState = 0U;
  bool haveTemperatureState = false;
  int16_t temperatureCentiDegrees = 0;
  bool haveBatteryVoltage = false;
  uint8_t batteryVoltageDecivolts = 0U;
  bool haveBatteryPercentage = false;
  uint8_t batteryPercentageRemainingHalf = 0U;
  bool demoGroupConfigured = false;
  uint8_t endDeviceTimeoutIndex = 0U;
  uint8_t endDeviceConfiguration = 0U;
  uint8_t parentInformation = 0U;
  bool endDeviceTimeoutNegotiated = false;
  ZigbeePreconfiguredKeyMode preconfiguredKeyMode =
      ZigbeePreconfiguredKeyMode::kNone;
  TrustCenterNodeState trustCenterState = TrustCenterNodeState::kIdle;
  NodeStage stage = NodeStage::kIdle;
};

static constexpr uint32_t kApsAckTimeoutMs = 900U;
static constexpr uint32_t kRecentInboundApsWindowMs = 4000U;
static constexpr uint8_t kApsAckRetryLimit = 2U;

bool sendApsFrameExtendedWithCounter(uint16_t destinationShort,
                                     uint8_t deliveryMode,
                                     uint16_t destinationGroup,
                                     uint8_t destinationEndpoint,
                                     uint16_t clusterId, uint16_t profileId,
                                     uint8_t sourceEndpoint,
                                     const uint8_t* payload,
                                     uint8_t payloadLength, uint8_t apsCounter,
                                     bool trackAck);

static NodeEntry g_nodes[kMaxNodes] = {};
static uint16_t g_nextShortAddress = 0x1000U;

NodeEntry* findNodeByIeee(uint64_t ieeeAddress) {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].ieeeAddress == ieeeAddress) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* findNodeByShort(uint16_t shortAddress) {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress == shortAddress) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* allocateNode(uint64_t ieeeAddress) {
  NodeEntry* existing = findNodeByIeee(ieeeAddress);
  if (existing != nullptr) {
    return existing;
  }

  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (!g_nodes[i].used) {
      memset(&g_nodes[i], 0, sizeof(g_nodes[i]));
      g_nodes[i].used = true;
      g_nodes[i].ieeeAddress = ieeeAddress;
      return &g_nodes[i];
    }
  }
  return nullptr;
}

uint16_t allocateShortAddress() {
  while (findNodeByShort(g_nextShortAddress) != nullptr ||
         g_nextShortAddress == 0x0000U || g_nextShortAddress == 0xFFFFU) {
    ++g_nextShortAddress;
  }
  return g_nextShortAddress++;
}

const uint8_t* findInstallCodeForNode(uint64_t ieeeAddress) {
  for (uint8_t i = 0U;
       i < static_cast<uint8_t>(sizeof(kPreconfiguredNodePolicies) /
                                sizeof(kPreconfiguredNodePolicies[0]));
       ++i) {
    if (kPreconfiguredNodePolicies[i].ieeeAddress == 0U) {
      continue;
    }
    if (kPreconfiguredNodePolicies[i].ieeeAddress == ieeeAddress) {
      return kPreconfiguredNodePolicies[i].installCode;
    }
  }
  return nullptr;
}

bool resolveTrustCenterLinkKey(NodeEntry* node, uint8_t outKey[16],
                               ZigbeePreconfiguredKeyMode* outMode) {
  if (node == nullptr || outKey == nullptr || outMode == nullptr) {
    return false;
  }

