lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
bool allocatePendingApsAckSlot(NodeEntry* node,
                               const ZigbeeApsDataFrame& aps,
                               uint8_t* outSlot) {
  if (node == nullptr || outSlot == nullptr) {
    return false;
  }

  const uint32_t nowMs = millis();
  uint8_t oldestActiveSlot = 0U;
  bool haveOldestActiveSlot = false;
  for (uint8_t i = 0U; i < kPendingApsAckSlots; ++i) {
    PendingApsAck& pending = node->pendingApsAcks[i];
    if (pending.active && pending.counter == aps.counter &&
        pending.clusterId == aps.clusterId &&
        pending.profileId == aps.profileId &&
        pending.destinationEndpoint == aps.destinationEndpoint &&
        pending.sourceEndpoint == aps.sourceEndpoint) {
      *outSlot = i;
      return true;
    }
    if (!pending.active ||
        static_cast<int32_t>(nowMs - pending.deadlineMs) >= 0) {
      *outSlot = i;
      return true;
    }
    if (!haveOldestActiveSlot ||
        static_cast<int32_t>(pending.deadlineMs -
                             node->pendingApsAcks[oldestActiveSlot].deadlineMs) < 0) {
      oldestActiveSlot = i;
      haveOldestActiveSlot = true;
    }
  }

  if (haveOldestActiveSlot) {
    *outSlot = oldestActiveSlot;
    return true;
  }
  return false;
}

void clearRecentInboundAps(NodeEntry* node) {
  if (node == nullptr) {
    return;
  }
  memset(&node->recentInboundAps, 0, sizeof(node->recentInboundAps));
}

void prepareNodeForRetainedRejoin(NodeEntry* node) {
  if (node == nullptr) {
    return;
  }
  node->pending.used = false;
  node->pending.payloadLength = 0U;
  node->pendingTransportKey = false;
  node->pendingNetworkKeyUpdate = false;
  node->pendingSwitchKey = false;
  node->pendingLeaveWithRejoin = false;
  node->pendingSecureRejoin = false;
  node->pendingAssociationResponse = false;
  node->pendingAssignedShort = 0U;
  node->pendingAssociationStatus = 0U;
  node->secureNwkSeen = false;
  node->lastInboundSecurityFrameCounter = 0U;
  node->trustCenterState = TrustCenterNodeState::kIdle;
  clearPendingApsAck(node);
  clearRecentInboundAps(node);
}

void rememberPendingApsAck(NodeEntry* node, const ZigbeeApsDataFrame& aps,
                           const uint8_t* payload, uint8_t payloadLength) {
  uint8_t slot = 0U;
  if (node == nullptr || aps.deliveryMode != kZigbeeApsDeliveryUnicast ||
      !aps.ackRequested ||
      payloadLength > sizeof(node->pendingApsAcks[0].frame.payload) ||
      (payloadLength > 0U && payload == nullptr)) {
    return;
  }
  if (!allocatePendingApsAckSlot(node, aps, &slot)) {
    return;
  }

  PendingApsAck& pending = node->pendingApsAcks[slot];
  memset(&pending, 0, sizeof(pending));
  pending.active = true;
  pending.counter = aps.counter;
  pending.clusterId = aps.clusterId;
  pending.profileId = aps.profileId;
  pending.destinationEndpoint = aps.destinationEndpoint;
  pending.sourceEndpoint = aps.sourceEndpoint;
  pending.retriesRemaining = kApsAckRetryLimit;
  pending.deadlineMs = millis() + kApsAckTimeoutMs;
  pending.frame.used = true;
  pending.frame.deliveryMode = aps.deliveryMode;
  pending.frame.destinationGroup = aps.destinationGroup;
  pending.frame.clusterId = aps.clusterId;
  pending.frame.profileId = aps.profileId;
  pending.frame.destinationEndpoint = aps.destinationEndpoint;
  pending.frame.sourceEndpoint = aps.sourceEndpoint;
  pending.frame.payloadLength = payloadLength;
  if (payloadLength > 0U) {
    memcpy(pending.frame.payload, payload, payloadLength);
  }
}

void rememberRecentInboundAps(NodeEntry* node, const ZigbeeApsDataFrame& aps) {
  if (node == nullptr) {
    return;
  }
  node->recentInboundAps.valid = true;
  node->recentInboundAps.counter = aps.counter;
  node->recentInboundAps.clusterId = aps.clusterId;
  node->recentInboundAps.profileId = aps.profileId;
  node->recentInboundAps.destinationEndpoint = aps.destinationEndpoint;
  node->recentInboundAps.sourceEndpoint = aps.sourceEndpoint;
  node->recentInboundAps.deliveryMode = aps.deliveryMode;
  node->recentInboundAps.expiresMs = millis() + kRecentInboundApsWindowMs;
}

bool isRecentInboundApsDuplicate(NodeEntry* node, const ZigbeeApsDataFrame& aps,
                                 uint32_t nowMs) {
  if (node == nullptr || !node->recentInboundAps.valid ||
      static_cast<int32_t>(nowMs - node->recentInboundAps.expiresMs) >= 0) {
    clearRecentInboundAps(node);
    return false;
  }
  return node->recentInboundAps.counter == aps.counter &&
         node->recentInboundAps.clusterId == aps.clusterId &&
         node->recentInboundAps.profileId == aps.profileId &&
         node->recentInboundAps.destinationEndpoint == aps.destinationEndpoint &&
         node->recentInboundAps.sourceEndpoint == aps.sourceEndpoint &&
         node->recentInboundAps.deliveryMode == aps.deliveryMode;
}

bool sendNwkCommand(NodeEntry* node, const uint8_t* payload,
                    uint8_t payloadLength) {
  if (node == nullptr || node->shortAddress == 0U || payload == nullptr ||
      payloadLength == 0U) {
    return false;
  }

  const uint8_t keySequence =
      (node->currentNetworkKeySequence != 0U)
          ? node->currentNetworkKeySequence
          : g_activeNetworkKeySequence;
  const uint8_t* networkKey = keyForSequence(keySequence);
  const bool useSecurity =
      (node->secureNwkSeen || node->currentNetworkKeySequence != 0U) &&
      networkKey != nullptr;

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kCommand;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = node->shortAddress;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kCoordinatorIeee;
    security.keySequence = keySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, networkKey,
                                              payload, payloadLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, payload, payloadLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        node->shortAddress, kCoordinatorShort,
                                        nwkFrame, nwkLength, psdu,
                                        &psduLength, false)) {
    return false;
  }
  return sendPsdu(psdu, psduLength);
}

