lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
void maybeExpirePendingApsAck(NodeEntry* node, uint32_t nowMs) {
  if (node == nullptr) {
    return;
  }

  for (uint8_t i = 0U; i < kPendingApsAckSlots; ++i) {
    PendingApsAck& pending = node->pendingApsAcks[i];
    if (!pending.active ||
        static_cast<int32_t>(nowMs - pending.deadlineMs) < 0) {
      continue;
    }
    if (pending.retriesRemaining > 0U && pending.frame.used) {
      --pending.retriesRemaining;
      const bool resent = resendPendingApsFrame(node, i);
      if (resent) {
        Serial.print("aps_ack retry short=0x");
        Serial.print(node->shortAddress, HEX);
        Serial.print(" ctr=0x");
        Serial.print(pending.counter, HEX);
        Serial.print(" remaining=");
        Serial.print(pending.retriesRemaining);
        Serial.print("\r\n");
        continue;
      }
    }

    Serial.print("aps_ack miss short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" ctr=0x");
    Serial.print(pending.counter, HEX);
    Serial.print(" cluster=0x");
    Serial.print(pending.clusterId, HEX);
    Serial.print("\r\n");
    clearPendingApsAckSlot(node, i);
  }
}

bool sendApsFrameExtendedWithCounter(uint16_t destinationShort,
                                     uint8_t deliveryMode,
                                     uint16_t destinationGroup,
                                     uint8_t destinationEndpoint,
                                     uint16_t clusterId, uint16_t profileId,
                                     uint8_t sourceEndpoint,
                                     const uint8_t* payload,
                                     uint8_t payloadLength, uint8_t apsCounter,
                                     bool trackAck) {
  NodeEntry* node = findNodeByShort(destinationShort);
  if (trackAck && deliveryMode == kZigbeeApsDeliveryUnicast &&
      (node == nullptr || !pendingApsAckSlotAvailable(*node, millis()))) {
    return false;
  }
  const uint8_t keySequence =
      (node != nullptr && node->currentNetworkKeySequence != 0U)
          ? node->currentNetworkKeySequence
          : g_activeNetworkKeySequence;
  const uint8_t* networkKey = keyForSequence(keySequence);
  const bool useSecurity =
      (node != nullptr && node->secureNwkSeen && networkKey != nullptr);

  ZigbeeApsDataFrame aps{};
  aps.frameType = ZigbeeApsFrameType::kData;
  aps.deliveryMode = deliveryMode;
  aps.ackRequested = (deliveryMode == kZigbeeApsDeliveryUnicast);
  aps.destinationEndpoint = destinationEndpoint;
  aps.destinationGroup = destinationGroup;
  aps.clusterId = clusterId;
  aps.profileId = profileId;
  aps.sourceEndpoint = sourceEndpoint;
  aps.counter = apsCounter;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  if (!ZigbeeCodec::buildApsDataFrame(aps, payload, payloadLength, apsFrame,
                                      &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = destinationShort;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kCoordinatorIeee;
    security.keySequence = keySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, networkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        destinationShort, kCoordinatorShort,
                                        nwkFrame, nwkLength, psdu,
                                        &psduLength, false)) {
    return false;
  }
  const bool sent = sendPsdu(psdu, psduLength);
  if (sent && trackAck) {
    rememberPendingApsAck(node, aps, payload, payloadLength);
  }
  return sent;
}

bool resendPendingApsFrame(NodeEntry* node, uint8_t slot) {
  if (node == nullptr || slot >= kPendingApsAckSlots) {
    return false;
  }

  PendingApsAck& pending = node->pendingApsAcks[slot];
  if (!pending.active || !pending.frame.used) {
    return false;
  }

  const bool sent = sendApsFrameExtendedWithCounter(
      node->shortAddress, pending.frame.deliveryMode,
      pending.frame.destinationGroup, pending.frame.destinationEndpoint,
      pending.frame.clusterId, pending.frame.profileId,
      pending.frame.sourceEndpoint, pending.frame.payload,
      pending.frame.payloadLength, pending.counter, false);
  if (sent) {
    pending.deadlineMs = millis() + kApsAckTimeoutMs;
  }
  return sent;
}

bool sendApsFrameExtended(uint16_t destinationShort, uint8_t deliveryMode,
                          uint16_t destinationGroup,
                          uint8_t destinationEndpoint, uint16_t clusterId,
                          uint16_t profileId, uint8_t sourceEndpoint,
                          const uint8_t* payload, uint8_t payloadLength) {
  return sendApsFrameExtendedWithCounter(destinationShort, deliveryMode,
                                         destinationGroup, destinationEndpoint,
                                         clusterId, profileId, sourceEndpoint,
                                         payload, payloadLength, g_apsCounter++,
                                         true);
}

bool sendApsAcknowledgement(NodeEntry* node, const ZigbeeApsDataFrame& request) {
  if (node == nullptr || request.deliveryMode != kZigbeeApsDeliveryUnicast ||
      !request.ackRequested) {
    return false;
  }

  const uint8_t keySequence =
      (node->currentNetworkKeySequence != 0U)
          ? node->currentNetworkKeySequence
          : g_activeNetworkKeySequence;
  const uint8_t* networkKey = keyForSequence(keySequence);
  const bool useSecurity =
      node->secureNwkSeen && networkKey != nullptr;

