lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  if (!ZigbeeCodec::buildApsDataAcknowledgement(request, apsFrame,
                                                &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = node->shortAddress;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kCoordinatorIeee;
    security.keySequence = keySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, networkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        node->shortAddress, kCoordinatorShort,
                                        nwkFrame, nwkLength, psdu,
                                        &psduLength, false)) {
    return false;
  }
  return sendPsdu(psdu, psduLength);
}

bool sendNwkRejoinResponse(NodeEntry* node, uint8_t status) {
  if (node == nullptr) {
    return false;
  }

  uint8_t payload[8] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildNwkRejoinResponseCommand(node->shortAddress, status,
                                                  payload, &payloadLength)) {
    return false;
  }
  return sendNwkCommand(node, payload, payloadLength);
}

bool sendEndDeviceTimeoutResponse(NodeEntry* node, uint8_t status,
                                  uint8_t parentInformation) {
  if (node == nullptr) {
    return false;
  }

  uint8_t payload[8] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildNwkEndDeviceTimeoutResponseCommand(
          status, parentInformation, payload, &payloadLength)) {
    return false;
  }
  return sendNwkCommand(node, payload, payloadLength);
}

bool sendTransportKey(NodeEntry* node) {
  if (node == nullptr || node->shortAddress == 0U || node->ieeeAddress == 0U) {
    return false;
  }

  uint8_t linkKey[16] = {0U};
  ZigbeePreconfiguredKeyMode keyMode = ZigbeePreconfiguredKeyMode::kNone;
  if (!resolveTrustCenterLinkKey(node, linkKey, &keyMode)) {
    return false;
  }
  node->preconfiguredKeyMode = keyMode;

  ZigbeeApsTransportKey transportKey{};
  transportKey.valid = true;
  transportKey.keyType = kZigbeeApsTransportKeyStandardNetworkKey;
  const bool sendAlternateKey =
      node->pendingNetworkKeyUpdate && g_haveAlternateNetworkKey;
  if ((!sendAlternateKey &&
       node->trustCenterState != TrustCenterNodeState::kWaitingTransportKey) ||
      (sendAlternateKey &&
       (node->trustCenterState != TrustCenterNodeState::kJoined ||
        node->currentNetworkKeySequence == 0U ||
        node->currentNetworkKeySequence == g_alternateNetworkKeySequence))) {
    return false;
  }
  const uint8_t keySequence =
      sendAlternateKey ? g_alternateNetworkKeySequence : g_activeNetworkKeySequence;
  const uint8_t* keyMaterial =
      sendAlternateKey ? g_alternateNetworkKey : g_activeNetworkKey;
  memcpy(transportKey.key, keyMaterial, sizeof(transportKey.key));
  transportKey.keySequence = keySequence;
  transportKey.destinationIeee = node->ieeeAddress;
  transportKey.sourceIeee = kCoordinatorIeee;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  ZigbeeApsSecurityHeader security{};
  security.valid = true;
  security.securityControl = kZigbeeSecurityControlApsEncMic32;
  security.frameCounter = g_apsTrustCenterFrameCounter++;
  security.sourceIeee = kCoordinatorIeee;
  if (!ZigbeeSecurity::buildSecuredApsTransportKeyCommand(
          transportKey, security, linkKey, g_apsCounter++, apsFrame,
          &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  const uint8_t nwkKeySequence =
      (node->currentNetworkKeySequence != 0U) ? node->currentNetworkKeySequence
                                              : g_activeNetworkKeySequence;
  const uint8_t* nwkKey = keyForSequence(nwkKeySequence);
  nwk.securityEnabled =
      (node->secureNwkSeen && node->currentNetworkKeySequence != 0U &&
       nwkKey != nullptr);
  nwk.destinationShort = node->shortAddress;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (nwk.securityEnabled) {
    ZigbeeNwkSecurityHeader nwkSecurity{};
    nwkSecurity.valid = true;
    nwkSecurity.securityControl = kZigbeeSecurityControlNwkEncMic32;
    nwkSecurity.frameCounter = g_nwkSecurityFrameCounter++;
    nwkSecurity.sourceIeee = kCoordinatorIeee;
    nwkSecurity.keySequence = nwkKeySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, nwkSecurity, nwkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        node->shortAddress, kCoordinatorShort,
                                        nwkFrame, nwkLength, psdu,
                                        &psduLength, false)) {
    return false;
  }
  return sendPsdu(psdu, psduLength);
}

