lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
bool sendApsFrame(uint16_t destinationShort, uint8_t destinationEndpoint,
                  uint16_t clusterId, uint16_t profileId,
                  uint8_t sourceEndpoint, const uint8_t* payload,
                  uint8_t payloadLength) {
  return sendApsFrameExtended(destinationShort, kZigbeeApsDeliveryUnicast, 0U,
                              destinationEndpoint, clusterId, profileId,
                              sourceEndpoint, payload, payloadLength);
}

bool queuePendingTransportKey(NodeEntry* node, bool networkKeyUpdate = false) {
  if (node == nullptr || node->pendingAssociationResponse ||
      node->pendingTransportKey || node->pendingSwitchKey || node->pending.used) {
    return false;
  }
  if (networkKeyUpdate) {
    if (!g_haveAlternateNetworkKey ||
        node->trustCenterState != TrustCenterNodeState::kJoined ||
        node->currentNetworkKeySequence == 0U ||
        node->currentNetworkKeySequence == g_alternateNetworkKeySequence) {
      return false;
    }
    node->pendingNetworkKeyUpdate = true;
  } else {
    node->pendingNetworkKeyUpdate = false;
    node->trustCenterState = TrustCenterNodeState::kWaitingTransportKey;
  }
  node->pendingTransportKey = true;
  return true;
}

bool queueNetworkKeyUpdateRollout() {
  if (!deriveAlternateNetworkKey()) {
    return false;
  }

  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    NodeEntry& node = g_nodes[i];
    if (!node.used || node.shortAddress == 0U || node.pendingAssociationResponse ||
        node.pendingTransportKey || node.pendingSwitchKey ||
        node.pendingSecureRejoin || node.pending.used ||
        node.currentNetworkKeySequence == 0U ||
        node.trustCenterState != TrustCenterNodeState::kJoined ||
        node.currentNetworkKeySequence == g_alternateNetworkKeySequence) {
      continue;
    }
    queuedAny = queuePendingTransportKey(&node, true) || queuedAny;
  }
  return queuedAny;
}

bool sendSwitchKey(NodeEntry* node) {
  if (node == nullptr || node->shortAddress == 0U || !g_haveAlternateNetworkKey ||
      node->currentNetworkKeySequence == 0U ||
      node->trustCenterState != TrustCenterNodeState::kAlternateKeyStaged) {
    return false;
  }

  uint8_t linkKey[16] = {0U};
  ZigbeePreconfiguredKeyMode keyMode = ZigbeePreconfiguredKeyMode::kNone;
  if (!resolveTrustCenterLinkKey(node, linkKey, &keyMode)) {
    return false;
  }
  node->preconfiguredKeyMode = keyMode;

  const uint8_t* currentKey = keyForSequence(node->currentNetworkKeySequence);
  if (currentKey == nullptr) {
    return false;
  }

  ZigbeeApsSwitchKey switchKey{};
  switchKey.valid = true;
  switchKey.keySequence = g_alternateNetworkKeySequence;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  ZigbeeApsSecurityHeader apsSecurity{};
  apsSecurity.valid = true;
  apsSecurity.securityControl = kZigbeeSecurityControlApsEncMic32;
  apsSecurity.frameCounter = g_apsTrustCenterFrameCounter++;
  apsSecurity.sourceIeee = kCoordinatorIeee;
  if (!ZigbeeSecurity::buildSecuredApsSwitchKeyCommand(
          switchKey, apsSecurity, linkKey, g_apsCounter++, apsFrame,
          &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = true;
  nwk.destinationShort = node->shortAddress;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  ZigbeeNwkSecurityHeader security{};
  security.valid = true;
  security.securityControl = kZigbeeSecurityControlNwkEncMic32;
  security.frameCounter = g_nwkSecurityFrameCounter++;
  security.sourceIeee = kCoordinatorIeee;
  security.keySequence = node->currentNetworkKeySequence;
  if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, currentKey, apsFrame,
                                            apsLength, nwkFrame, &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        node->shortAddress, kCoordinatorShort,
                                        nwkFrame, nwkLength, psdu,
                                        &psduLength, false)) {
    return false;
  }
  return sendPsdu(psdu, psduLength);
}

bool sendUpdateDevice(NodeEntry* node) {
  if (node == nullptr || node->shortAddress == 0U || node->ieeeAddress == 0U) {
    return false;
  }
  if (!secureRejoinAllowed(node) ||
      node->trustCenterState != TrustCenterNodeState::kWaitingUpdateDevice) {
    return false;
  }

  uint8_t linkKey[16] = {0U};
  ZigbeePreconfiguredKeyMode keyMode = ZigbeePreconfiguredKeyMode::kNone;
  if (!resolveTrustCenterLinkKey(node, linkKey, &keyMode)) {
    return false;
  }
  node->preconfiguredKeyMode = keyMode;

  ZigbeeApsUpdateDevice updateDevice{};
  updateDevice.valid = true;
  updateDevice.deviceIeee = node->ieeeAddress;
  updateDevice.deviceShort = node->shortAddress;
  updateDevice.status = kZigbeeApsUpdateDeviceStatusStandardSecureRejoin;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  ZigbeeApsSecurityHeader apsSecurity{};
  apsSecurity.valid = true;
  apsSecurity.securityControl = kZigbeeSecurityControlApsEncMic32;
  apsSecurity.frameCounter = g_apsTrustCenterFrameCounter++;
  apsSecurity.sourceIeee = kCoordinatorIeee;
  if (!ZigbeeSecurity::buildSecuredApsUpdateDeviceCommand(
          updateDevice, apsSecurity, linkKey, g_apsCounter++, apsFrame,
          &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = true;
  nwk.destinationShort = node->shortAddress;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  ZigbeeNwkSecurityHeader security{};
  security.valid = true;
  security.securityControl = kZigbeeSecurityControlNwkEncMic32;
  security.frameCounter = g_nwkSecurityFrameCounter++;
  security.sourceIeee = kCoordinatorIeee;
  const uint8_t keySequence =
      (node->currentNetworkKeySequence != 0U) ? node->currentNetworkKeySequence
                                              : g_activeNetworkKeySequence;
  const uint8_t* networkKey = keyForSequence(keySequence);
  if (networkKey == nullptr) {
    return false;
  }
  security.keySequence = keySequence;
  if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, networkKey,
                                            apsFrame, apsLength, nwkFrame,
                                            &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        node->shortAddress, kCoordinatorShort,
                                        nwkFrame, nwkLength, psdu,
                                        &psduLength, false)) {
    return false;
  }
  return sendPsdu(psdu, psduLength);
}

