lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildReadReportingConfigurationRequest(
          records, recordCount, g_zclSequence++, payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, clusterId, kZigbeeProfileHomeAutomation,
                           node->endpoint, kCoordinatorEndpoint, payload,
                           payloadLength);
  if (queued) {
    node->awaitingClusterId = clusterId;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

bool reportingConfigurationMatches(
    uint16_t clusterId,
    const ZigbeeReadReportingConfigurationResponseRecord* records,
    uint8_t recordCount) {
  if (records == nullptr) {
    return false;
  }

  switch (clusterId) {
    case kZigbeeClusterOnOff:
      return recordCount == 1U && records[0].status == 0x00U &&
             records[0].direction == 0U && records[0].attributeId == 0x0000U &&
             records[0].dataType == ZigbeeZclDataType::kBoolean &&
             records[0].minimumIntervalSeconds == 0U &&
             records[0].maximumIntervalSeconds == 60U &&
             records[0].reportableChange == 0U;
    case kZigbeeClusterLevelControl:
      return recordCount == 1U && records[0].status == 0x00U &&
             records[0].direction == 0U && records[0].attributeId == 0x0000U &&
             records[0].dataType == ZigbeeZclDataType::kUint8 &&
             records[0].minimumIntervalSeconds == 0U &&
             records[0].maximumIntervalSeconds == 60U &&
             records[0].reportableChange == 16U;
    case kZigbeeClusterTemperatureMeasurement:
      return recordCount == 1U && records[0].status == 0x00U &&
             records[0].direction == 0U && records[0].attributeId == 0x0000U &&
             records[0].dataType == ZigbeeZclDataType::kInt16 &&
             records[0].minimumIntervalSeconds == 5U &&
             records[0].maximumIntervalSeconds == 60U &&
             records[0].reportableChange == 25U;
    case kZigbeeClusterPowerConfiguration:
      return recordCount == 2U && records[0].status == 0x00U &&
             records[0].direction == 0U && records[0].attributeId == 0x0020U &&
             records[0].dataType == ZigbeeZclDataType::kUint8 &&
             records[0].minimumIntervalSeconds == 30U &&
             records[0].maximumIntervalSeconds == 300U &&
             records[0].reportableChange == 1U && records[1].status == 0x00U &&
             records[1].direction == 0U && records[1].attributeId == 0x0021U &&
             records[1].dataType == ZigbeeZclDataType::kUint8 &&
             records[1].minimumIntervalSeconds == 30U &&
             records[1].maximumIntervalSeconds == 300U &&
             records[1].reportableChange == 2U;
    default:
      return false;
  }
}

bool queueOnOffCommand(NodeEntry* node, uint8_t commandId) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsOnOff) {
    return false;
  }
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = commandId;
  if (!ZigbeeCodec::buildZclFrame(frame, nullptr, 0U, payload, &payloadLength)) {
    return false;
  }
  return queuePendingApsFrame(node, kZigbeeClusterOnOff,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueLevelMoveToLevel(NodeEntry* node, uint8_t level) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsLevelControl) {
    return false;
  }

  const uint8_t commandPayload[] = {level, 0x00U, 0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kLevelControlCommandMoveToLevelWithOnOff;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterLevelControl,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueLevelStep(NodeEntry* node, bool increase, uint8_t stepSize) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsLevelControl) {
    return false;
  }

  const uint8_t commandPayload[] = {
      static_cast<uint8_t>(increase ? 0x00U : 0x01U), stepSize, 0x00U, 0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kLevelControlCommandStepWithOnOff;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterLevelControl,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueIdentifyCommand(NodeEntry* node, uint16_t identifyTimeSeconds) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsIdentify) {
    return false;
  }

  const uint8_t commandPayload[] = {
      static_cast<uint8_t>(identifyTimeSeconds & 0xFFU),
      static_cast<uint8_t>((identifyTimeSeconds >> 8U) & 0xFFU)};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kIdentifyCommandIdentify;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterIdentify,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueIdentifyDiscoverAttributesExtended(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsIdentify) {
    return false;
  }

