lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
bool queueGroupLevelStep(NodeEntry* node, uint16_t groupId, bool increase,
                         uint8_t stepSize) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsLevelControl ||
      !node->demoGroupConfigured) {
    return false;
  }

  const uint8_t commandPayload[] = {
      static_cast<uint8_t>(increase ? 0x00U : 0x01U), stepSize, 0x00U, 0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = true;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kLevelControlCommandStepWithOnOff;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrameExtended(
      node, kZigbeeApsDeliveryGroup, groupId, kZigbeeClusterLevelControl,
      kZigbeeProfileHomeAutomation, 0U, kCoordinatorEndpoint, payload,
      payloadLength);
}

bool queueDemoGroupEnrollment() {
  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    NodeEntry& node = g_nodes[i];
    if (!node.used || node.shortAddress == 0U || node.endpoint == 0U ||
        node.demoGroupConfigured ||
        (!node.supportsOnOff && !node.supportsLevelControl)) {
      continue;
    }
    queuedAny = queueAddGroup(&node, kDemoGroupId, "DemoGrp") || queuedAny;
  }
  return queuedAny;
}

bool queueDemoGroupOnOff(uint8_t commandId) {
  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    queuedAny = queueGroupOnOffCommand(&g_nodes[i], kDemoGroupId, commandId) ||
                queuedAny;
  }
  return queuedAny;
}

bool queueDemoGroupLevelMoveToLevel(uint8_t level) {
  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    queuedAny =
        queueGroupLevelMoveToLevel(&g_nodes[i], kDemoGroupId, level) ||
        queuedAny;
  }
  return queuedAny;
}

bool queueDemoGroupLevelStep(bool increase, uint8_t stepSize) {
  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    queuedAny =
        queueGroupLevelStep(&g_nodes[i], kDemoGroupId, increase, stepSize) ||
        queuedAny;
  }
  return queuedAny;
}

NodeEntry* firstOnOffNode() {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress != 0U &&
        g_nodes[i].supportsOnOff && g_nodes[i].endpoint != 0U) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* firstLevelNode() {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress != 0U &&
        g_nodes[i].supportsLevelControl && g_nodes[i].endpoint != 0U) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* firstIdentifyNode() {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress != 0U &&
        g_nodes[i].supportsIdentify && g_nodes[i].endpoint != 0U) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* firstJoinedNode() {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress != 0U) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

void clearNodeInterviewState(NodeEntry* node) {
  if (node == nullptr) {
    return;
  }
  node->haveNodeDescriptor = false;
  node->logicalType = 0U;
  node->macCapabilityFlags = 0U;
  node->manufacturerCode = 0U;
  node->havePowerDescriptor = false;
  node->availablePowerSources = 0U;
  node->currentPowerSource = 0U;
  node->currentPowerSourceLevel = 0U;
  node->haveBasicZclVersion = false;
  node->basicZclVersion = 0U;
  node->haveBasicApplicationVersion = false;
  node->basicApplicationVersion = 0U;
  node->haveBasicStackVersion = false;
  node->basicStackVersion = 0U;
  node->haveBasicHwVersion = false;
  node->basicHwVersion = 0U;
  node->haveBasicPowerSource = false;
  node->basicPowerSource = 0U;
  node->basicManufacturerName[0] = '\0';
  node->basicModelIdentifier[0] = '\0';
  node->basicSwBuildId[0] = '\0';
  node->haveOnOffState = false;
  node->onOffState = false;
  node->haveLevelState = false;
  node->levelState = 0U;
  node->haveTemperatureState = false;
  node->temperatureCentiDegrees = 0;
  node->haveBatteryVoltage = false;
  node->batteryVoltageDecivolts = 0U;
  node->haveBatteryPercentage = false;
  node->batteryPercentageRemainingHalf = 0U;
  node->haveIdentifyTime = false;
  node->identifyTimeSeconds = 0U;
}

void copyNodeString(char* destination, size_t destinationSize,
                    const ZigbeeAttributeValue& value) {
  if (destination == nullptr || destinationSize == 0U) {
    return;
  }
  destination[0] = '\0';
  if (value.type != ZigbeeZclDataType::kCharString ||
      value.stringValue == nullptr) {
    return;
  }

  size_t copyLength = value.stringLength;
  if (copyLength >= destinationSize) {
    copyLength = destinationSize - 1U;
  }
  memcpy(destination, value.stringValue, copyLength);
  destination[copyLength] = '\0';
}

void printCentiDegrees(int16_t centiDegrees) {
  if (centiDegrees < 0) {
    Serial.print("-");
    centiDegrees = static_cast<int16_t>(-centiDegrees);
  }
  Serial.print(centiDegrees / 100);
  Serial.print(".");
  const uint8_t fraction = static_cast<uint8_t>(centiDegrees % 100);
  if (fraction < 10U) {
    Serial.print("0");
  }
  Serial.print(fraction);
}

void updateNodeAttributeState(NodeEntry* node, uint16_t clusterId,
                              const ZigbeeAttributeValue& value,
                              uint16_t attributeId) {
  if (node == nullptr) {
    return;
  }

  if (clusterId == kZigbeeClusterBasic) {
    switch (attributeId) {
      case 0x0000U:
        if (value.type == ZigbeeZclDataType::kUint8) {
          node->haveBasicZclVersion = true;
          node->basicZclVersion = value.data.u8;
        }
        return;
      case 0x0001U:
        if (value.type == ZigbeeZclDataType::kUint8) {
          node->haveBasicApplicationVersion = true;
          node->basicApplicationVersion = value.data.u8;
        }
        return;
      case 0x0002U:
        if (value.type == ZigbeeZclDataType::kUint8) {
          node->haveBasicStackVersion = true;
          node->basicStackVersion = value.data.u8;
        }
        return;
      case 0x0003U:
        if (value.type == ZigbeeZclDataType::kUint8) {
          node->haveBasicHwVersion = true;
          node->basicHwVersion = value.data.u8;
        }
        return;
      case 0x0004U:
        copyNodeString(node->basicManufacturerName,
                       sizeof(node->basicManufacturerName), value);
        return;
      case 0x0005U:
        copyNodeString(node->basicModelIdentifier,
                       sizeof(node->basicModelIdentifier), value);
        return;
      case 0x0007U:
        if (value.type == ZigbeeZclDataType::kUint8) {
          node->haveBasicPowerSource = true;
          node->basicPowerSource = value.data.u8;
        }
        return;
      case 0x4000U:
        copyNodeString(node->basicSwBuildId, sizeof(node->basicSwBuildId),
                       value);
        return;
      default:
        break;
    }
  }

  if (clusterId == kZigbeeClusterOnOff && attributeId == 0x0000U &&
      value.type == ZigbeeZclDataType::kBoolean) {
    node->haveOnOffState = true;
    node->onOffState = value.data.boolValue;
    return;
  }

  if (clusterId == kZigbeeClusterLevelControl && attributeId == 0x0000U &&
      value.type == ZigbeeZclDataType::kUint8) {
    node->haveLevelState = true;
    node->levelState = value.data.u8;
    return;
  }

  if (clusterId == kZigbeeClusterTemperatureMeasurement &&
      attributeId == 0x0000U && value.type == ZigbeeZclDataType::kInt16) {
    node->haveTemperatureState = true;
    node->temperatureCentiDegrees = value.data.i16;
    return;
  }

  if (clusterId == kZigbeeClusterPowerConfiguration &&
      attributeId == 0x0020U && value.type == ZigbeeZclDataType::kUint8) {
    node->haveBatteryVoltage = true;
    node->batteryVoltageDecivolts = value.data.u8;
    return;
  }

  if (clusterId == kZigbeeClusterPowerConfiguration &&
      attributeId == 0x0021U && value.type == ZigbeeZclDataType::kUint8) {
    node->haveBatteryPercentage = true;
    node->batteryPercentageRemainingHalf = value.data.u8;
    return;
  }

  if (clusterId == kZigbeeClusterIdentify && attributeId == 0x0000U &&
      value.type == ZigbeeZclDataType::kUint16) {
    node->haveIdentifyTime = true;
    node->identifyTimeSeconds = value.data.u16;
  }
}

void applyReadAttributeState(NodeEntry* node, uint16_t clusterId,
                             const ZigbeeReadAttributeRecord* records,
                             uint8_t recordCount) {
  if (node == nullptr || records == nullptr) {
    return;
  }
  for (uint8_t i = 0U; i < recordCount; ++i) {
    if (records[i].status != 0x00U) {
      continue;
    }
    updateNodeAttributeState(node, clusterId, records[i].value,
                             records[i].attributeId);
  }
}

