lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
void handleAssociationRequest(const ZigbeeMacAssociationRequestView& request,
                              int8_t rssiDbm) {
  if (request.coordinatorPanId != kPanId ||
      request.coordinatorShort != kCoordinatorShort) {
    return;
  }
  if (!g_permitJoinEnabled) {
    Serial.print("assoc_drop reason=permit_join_closed ieee=0x");
    Serial.print(static_cast<uint32_t>(request.deviceExtended >> 32U), HEX);
    Serial.print(static_cast<uint32_t>(request.deviceExtended & 0xFFFFFFFFUL),
                 HEX);
    Serial.print("\r\n");
    return;
  }

  NodeEntry* node = allocateNode(request.deviceExtended);
  if (node == nullptr) {
    Serial.print("assoc_drop reason=no_slot\r\n");
    return;
  }

  node->pending.used = false;
  node->pending.payloadLength = 0U;
  node->pendingTransportKey = false;
  node->pendingNetworkKeyUpdate = false;
  node->pendingSwitchKey = false;
  clearPendingApsAck(node);
  clearRecentInboundAps(node);
  clearNodeInterviewState(node);
  node->endpoint = 0U;
  node->profileId = 0U;
  node->deviceId = 0U;
  node->supportsOnOff = false;
  node->supportsLevelControl = false;
  node->supportsIdentify = false;
  node->supportsTemperature = false;
  node->supportsPowerConfiguration = false;
  node->basicRead = false;
  node->onOffBindingConfigured = false;
  node->levelBindingConfigured = false;
  node->temperatureBindingConfigured = false;
  node->powerBindingConfigured = false;
  node->onOffReportingConfigured = false;
  node->levelReportingConfigured = false;
  node->temperatureReportingConfigured = false;
  node->powerReportingConfigured = false;
  node->onOffReportingVerified = false;
  node->levelReportingVerified = false;
  node->temperatureReportingVerified = false;
  node->powerReportingVerified = false;
  node->awaitingBindResponse = false;
  node->awaitingClusterId = 0U;
  node->demoGroupConfigured = false;
  node->trustCenterState = TrustCenterNodeState::kIdle;
  if (node->shortAddress == 0U) {
    node->pendingAssignedShort = allocateShortAddress();
    node->secureNwkSeen = false;
    node->lastInboundSecurityFrameCounter = 0U;
    node->currentNetworkKeySequence = 0U;
    node->preconfiguredKeyMode = ZigbeePreconfiguredKeyMode::kNone;
    node->pendingSecureRejoin = false;
  } else {
    node->pendingAssignedShort = node->shortAddress;
    node->pendingSecureRejoin = secureRejoinAllowed(node);
    if (!node->pendingSecureRejoin) {
      node->secureNwkSeen = false;
      node->lastInboundSecurityFrameCounter = 0U;
      node->currentNetworkKeySequence = 0U;
    }
  }
  node->pendingAssociationStatus = 0U;
  node->pendingAssociationResponse = true;
  node->lastSeenMs = millis();

  Serial.print("assoc ieee=0x");
  Serial.print(static_cast<uint32_t>(request.deviceExtended >> 32U), HEX);
  Serial.print(static_cast<uint32_t>(request.deviceExtended & 0xFFFFFFFFUL), HEX);
  Serial.print(" assigned=0x");
  Serial.print(node->pendingAssignedShort, HEX);
  Serial.print(" rejoin=");
  Serial.print(node->pendingSecureRejoin ? "yes" : "no");
  Serial.print(" cap=0x");
  Serial.print(request.capabilityInformation, HEX);
  Serial.print(" rssi=");
  Serial.print(rssiDbm);
  Serial.print("dBm\r\n");
}

void handleDataRequest(const ZigbeeMacFrame& frame) {
  if (frame.source.mode != ZigbeeMacAddressMode::kExtended) {
    return;
  }

  NodeEntry* node = findNodeByIeee(frame.source.extendedAddress);
  if (node == nullptr) {
    return;
  }

  node->lastSeenMs = millis();
  if (node->pendingAssociationResponse) {
    const bool sent = sendPendingAssociationResponse(node);
    Serial.print("assoc_rsp ");
    Serial.print(sent ? "OK" : "FAIL");
    Serial.print(" short=0x");
    Serial.print(node->pendingAssignedShort, HEX);
    Serial.print("\r\n");
    return;
  }

  if (node->pending.used || node->pendingTransportKey ||
      node->pendingSecureRejoin || node->pendingSwitchKey) {
    const bool readyForSend =
        !node->pending.used ||
        node->pending.deliveryMode != kZigbeeApsDeliveryUnicast ||
        pendingApsAckSlotAvailable(*node, millis());
    if (readyForSend) {
      const bool sent = sendPendingApsFrame(node);
      Serial.print("poll_deliver ");
      Serial.print(sent ? "OK" : "FAIL");
      Serial.print(" dst=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print("\r\n");
    }
  }
}

void handleOrphanNotification(const ZigbeeMacOrphanNotificationView& orphan,
                              int8_t rssiDbm) {
  NodeEntry* node = findNodeByIeee(orphan.deviceExtended);
  if (node == nullptr || node->shortAddress == 0U || !secureRejoinAllowed(node)) {
    return;
  }

  if (!sendCoordinatorRealignment(node)) {
    return;
  }

  node->pendingSecureRejoin = true;
  node->trustCenterState = TrustCenterNodeState::kWaitingUpdateDevice;
  node->lastSeenMs = millis();
  Serial.print("orphan_realign short=0x");
  Serial.print(node->shortAddress, HEX);
  Serial.print(" lk=");
  Serial.print(ZigbeeCommissioning::keyModeName(node->preconfiguredKeyMode));
  Serial.print(" tc=");
  Serial.print(trustCenterStateName(node->trustCenterState));
  Serial.print(" rssi=");
  Serial.print(rssiDbm);
  Serial.print("dBm\r\n");
}

void handleNwkRejoinRequest(NodeEntry* node,
                            const ZigbeeNwkRejoinRequest& request) {
  if (node == nullptr || !request.valid) {
    return;
  }

  node->pendingSecureRejoin = secureRejoinAllowed(node);
  if (node->pendingSecureRejoin) {
    node->trustCenterState = TrustCenterNodeState::kWaitingUpdateDevice;
  }
  node->lastSeenMs = millis();
  const bool sent = sendNwkRejoinResponse(node, 0x00U);
  Serial.print("nwk_rejoin short=0x");
  Serial.print(node->shortAddress, HEX);
  Serial.print(" cap=0x");
  Serial.print(request.capabilityInformation, HEX);
  Serial.print(" tc=");
  Serial.print(trustCenterStateName(node->trustCenterState));
  Serial.print(" rsp=");
  Serial.print(sent ? "OK" : "FAIL");
  Serial.print("\r\n");
}

void handleEndDeviceTimeoutRequest(
    NodeEntry* node, const ZigbeeNwkEndDeviceTimeoutRequest& request) {
  if (node == nullptr || !request.valid) {
    return;
  }

  node->endDeviceTimeoutIndex = request.requestedTimeout;
  node->endDeviceConfiguration = request.endDeviceConfiguration;
  node->parentInformation =
      kZigbeeNwkParentInfoMacDataPollKeepalive |
      kZigbeeNwkParentInfoEndDeviceTimeoutSupported;
  node->endDeviceTimeoutNegotiated = true;
  const bool sent = sendEndDeviceTimeoutResponse(
      node, kZigbeeNwkEndDeviceTimeoutSuccess, node->parentInformation);
  Serial.print("end_device_timeout short=0x");
  Serial.print(node->shortAddress, HEX);
  Serial.print(" req=0x");
  Serial.print(request.requestedTimeout, HEX);
  Serial.print(" rsp=");
  Serial.print(sent ? "OK" : "FAIL");
  Serial.print("\r\n");
}

