lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
void handleZdoFrame(NodeEntry* node, const ZigbeeApsDataFrame& aps) {
  if (node == nullptr) {
    return;
  }

  if (aps.clusterId == kZigbeeZdoMgmtPermitJoinRequest) {
    uint8_t transactionSequence = 0U;
    uint8_t permitDurationSeconds = 0U;
    bool trustCenterSignificance = false;
    if (!ZigbeeCodec::parseZdoMgmtPermitJoinRequest(
            aps.payload, aps.payloadLength, &transactionSequence,
            &permitDurationSeconds, &trustCenterSignificance)) {
      return;
    }

    if (permitDurationSeconds == 0U) {
      g_permitJoinEnabled = false;
      g_permitJoinDeadlineMs = 0U;
    } else {
      g_permitJoinEnabled = true;
      g_permitJoinDeadlineMs =
          (permitDurationSeconds == 0xFFU)
              ? 0U
              : (millis() +
                 (static_cast<uint32_t>(permitDurationSeconds) * 1000UL));
    }

    Serial.print("mgmt_permit_join short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" duration_s=");
    Serial.print(permitDurationSeconds);
    Serial.print(" tc=");
    Serial.print(trustCenterSignificance ? "1" : "0");
    Serial.print("\r\n");

    const uint8_t responsePayload[2] = {transactionSequence, 0x00U};
    (void)sendApsFrame(node->shortAddress, 0U,
                       kZigbeeZdoMgmtPermitJoinResponse, kZigbeeProfileZdo, 0U,
                       responsePayload, sizeof(responsePayload));
    return;
  }

  if (aps.clusterId == kZigbeeZdoDeviceAnnounce && aps.payloadLength >= 12U) {
    const uint16_t announcedShort =
        static_cast<uint16_t>(aps.payload[1]) |
        (static_cast<uint16_t>(aps.payload[2]) << 8U);
    node->shortAddress = announcedShort;
    node->announced = true;
    Serial.print("device_announce short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" ieee=0x");
    Serial.print(static_cast<uint32_t>(node->ieeeAddress >> 32U), HEX);
    Serial.print(static_cast<uint32_t>(node->ieeeAddress & 0xFFFFFFFFUL), HEX);
    Serial.print("\r\n");
    if (!node->haveNodeDescriptor) {
      (void)queueNodeDescriptorRequest(node);
    } else if (!node->havePowerDescriptor) {
      (void)queuePowerDescriptorRequest(node);
    } else if (node->endpoint == 0U) {
      (void)queueActiveEndpointsRequest(node);
    }
    return;
  }

  if (aps.clusterId == kZigbeeZdoNodeDescriptorResponse) {
    ZigbeeZdoNodeDescriptorResponseView view{};
    if (!ZigbeeCodec::parseZdoNodeDescriptorResponse(
            aps.payload, aps.payloadLength, &view) ||
        !view.valid || view.status != 0x00U) {
      return;
    }

    node->haveNodeDescriptor = true;
    node->logicalType = view.logicalType;
    node->macCapabilityFlags = view.macCapabilityFlags;
    node->manufacturerCode = view.manufacturerCode;
    Serial.print("node_desc short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" logical_type=0x");
    Serial.print(node->logicalType, HEX);
    Serial.print(" mac_cap=0x");
    Serial.print(node->macCapabilityFlags, HEX);
    Serial.print(" mfg=0x");
    Serial.print(node->manufacturerCode, HEX);
    Serial.print("\r\n");
    (void)queuePowerDescriptorRequest(node);
    return;
  }

  if (aps.clusterId == kZigbeeZdoPowerDescriptorResponse) {
    ZigbeeZdoPowerDescriptorResponseView view{};
    if (!ZigbeeCodec::parseZdoPowerDescriptorResponse(
            aps.payload, aps.payloadLength, &view) ||
        !view.valid || view.status != 0x00U) {
      return;
    }

    node->havePowerDescriptor = true;
    node->availablePowerSources = view.availablePowerSources;
    node->currentPowerSource = view.currentPowerSource;
    node->currentPowerSourceLevel = view.currentPowerSourceLevel;
    Serial.print("power_desc short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" avail=0x");
    Serial.print(node->availablePowerSources, HEX);
    Serial.print(" current=0x");
    Serial.print(node->currentPowerSource, HEX);
    Serial.print(" level=0x");
    Serial.print(node->currentPowerSourceLevel, HEX);
    Serial.print("\r\n");
    (void)queueActiveEndpointsRequest(node);
    return;
  }

  if (aps.clusterId == kZigbeeZdoActiveEndpointsResponse) {
    ZigbeeZdoActiveEndpointsResponseView view{};
    if (!ZigbeeCodec::parseZdoActiveEndpointsResponse(
            aps.payload, aps.payloadLength, &view) ||
        !view.valid || view.status != 0x00U || view.endpointCount == 0U) {
      return;
    }

    node->endpoint = view.endpoints[0];
    Serial.print("active_ep short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" ep=");
    Serial.print(node->endpoint);
    Serial.print("\r\n");
    (void)queueSimpleDescriptorRequest(node, node->endpoint);
    return;
  }

  if (aps.clusterId == kZigbeeZdoBindResponse) {
    uint8_t transactionSequence = 0U;
    uint8_t status = 0xFFU;
    if (!ZigbeeCodec::parseZdoStatusResponse(aps.payload, aps.payloadLength,
                                             &transactionSequence, &status)) {
      return;
    }

    Serial.print("bind_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cluster=0x");
    Serial.print(node->awaitingClusterId, HEX);
    Serial.print(" status=0x");
    Serial.print(status, HEX);
    Serial.print("\r\n");

    if (node->awaitingClusterId == kZigbeeClusterOnOff) {
      node->onOffBindingConfigured = true;
    } else if (node->awaitingClusterId == kZigbeeClusterLevelControl) {
      node->levelBindingConfigured = true;
    } else if (node->awaitingClusterId ==
               kZigbeeClusterTemperatureMeasurement) {
      node->temperatureBindingConfigured = true;
    } else if (node->awaitingClusterId == kZigbeeClusterPowerConfiguration) {
      node->powerBindingConfigured = true;
    }
    node->awaitingBindResponse = false;
    if (queueNextReportingStep(node)) {
      return;
    }
    node->stage = NodeStage::kReady;
    return;
  }

  if (aps.clusterId == kZigbeeZdoMgmtLeaveResponse) {
    uint8_t transactionSequence = 0U;
    uint8_t status = 0xFFU;
    if (!ZigbeeCodec::parseZdoStatusResponse(aps.payload, aps.payloadLength,
                                             &transactionSequence, &status)) {
      return;
    }

    Serial.print("leave_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" status=0x");
    Serial.print(status, HEX);
    Serial.print(" rejoin=");
    Serial.print(node->pendingLeaveWithRejoin ? "yes" : "no");
    Serial.print("\r\n");
    if (status == 0x00U) {
      if (node->pendingLeaveWithRejoin) {
        prepareNodeForRetainedRejoin(node);
      } else {
        memset(node, 0, sizeof(*node));
      }
    } else {
      node->pendingLeaveWithRejoin = false;
    }
    return;
  }

  if (aps.clusterId == kZigbeeZdoSimpleDescriptorResponse) {
    ZigbeeZdoSimpleDescriptorResponseView view{};
    if (!ZigbeeCodec::parseZdoSimpleDescriptorResponse(
            aps.payload, aps.payloadLength, &view) ||
        !view.valid || view.status != 0x00U) {
      return;
    }

