lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
  if (aps.clusterId == kZigbeeClusterIdentify &&
      zcl.frameType == ZigbeeZclFrameType::kClusterSpecific &&
      zcl.commandId == kIdentifyCommandIdentify) {
    node->haveIdentifyTime = true;
    node->identifyTimeSeconds =
        (zcl.payloadLength >= 2U)
            ? static_cast<uint16_t>(zcl.payload[0]) |
                  (static_cast<uint16_t>(zcl.payload[1]) << 8U)
            : 0U;
    Serial.print("identify_query_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" timeout_s=");
    Serial.print(node->identifyTimeSeconds);
    Serial.print("\r\n");
    return;
  }

  if (aps.clusterId == kZigbeeClusterGroups &&
      zcl.frameType == ZigbeeZclFrameType::kClusterSpecific &&
      zcl.commandId == kGroupsCommandAddGroup && zcl.payloadLength >= 3U) {
    const uint8_t status = zcl.payload[0];
    const uint16_t groupId = static_cast<uint16_t>(zcl.payload[1]) |
                             (static_cast<uint16_t>(zcl.payload[2]) << 8U);
    if (status == 0x00U && groupId == kDemoGroupId) {
      node->demoGroupConfigured = true;
    }
    Serial.print("group_add_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" group=0x");
    Serial.print(groupId, HEX);
    Serial.print(" status=0x");
    Serial.print(status, HEX);
    Serial.print("\r\n");
    return;
  }

  if (zcl.frameType == ZigbeeZclFrameType::kGlobal &&
      zcl.commandId == kZclCommandReportAttributes) {
    ZigbeeAttributeReportRecord records[8];
    uint8_t recordCount = 0U;
    if (!ZigbeeCodec::parseAttributeReport(
            zcl.payload, zcl.payloadLength, records,
            static_cast<uint8_t>(sizeof(records) / sizeof(records[0])),
            &recordCount)) {
      return;
    }
    applyReportedAttributeState(node, aps.clusterId, records, recordCount);

    Serial.print("report short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" ");
    for (uint8_t i = 0U; i < recordCount; ++i) {
      Serial.print("attr=0x");
      Serial.print(records[i].attributeId, HEX);
      Serial.print(":");
      printAttributeValue(records[i].value);
      Serial.print(" ");
    }
    Serial.print("\r\n");
    return;
  }

  if (zcl.frameType == ZigbeeZclFrameType::kGlobal &&
      zcl.commandId == kZclCommandDefaultResponse && zcl.payloadLength >= 2U) {
    Serial.print("default_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cmd=0x");
    Serial.print(zcl.payload[0], HEX);
    Serial.print(" status=0x");
    Serial.print(zcl.payload[1], HEX);
    Serial.print("\r\n");
  }
}

void processIncomingFrame(const ZigbeeFrame& frame) {
  ZigbeeMacFrame mac{};
  if (!ZigbeeCodec::parseMacFrame(frame.psdu, frame.length, &mac) || !mac.valid) {
    return;
  }

  if (mac.frameType == ZigbeeMacFrameType::kCommand) {
    if (mac.commandId == kZigbeeMacCommandBeaconRequest) {
      (void)sendBeacon();
      return;
    }

    ZigbeeMacOrphanNotificationView orphan{};
    if (ZigbeeCodec::parseOrphanNotification(frame.psdu, frame.length,
                                             &orphan)) {
      handleOrphanNotification(orphan, frame.rssiDbm);
      return;
    }

    ZigbeeMacAssociationRequestView association{};
    if (ZigbeeCodec::parseAssociationRequest(frame.psdu, frame.length,
                                             &association)) {
      handleAssociationRequest(association, frame.rssiDbm);
      return;
    }

    if (mac.commandId == kZigbeeMacCommandDataRequest &&
        mac.destination.mode == ZigbeeMacAddressMode::kShort &&
        mac.destination.panId == kPanId &&
        mac.destination.shortAddress == kCoordinatorShort) {
      handleDataRequest(mac);
      return;
    }
    return;
  }

  ZigbeeDataFrameView macData{};
  if (!ZigbeeRadio::parseDataFrameShort(frame.psdu, frame.length, &macData) ||
      !macData.valid || macData.panId != kPanId ||
      macData.destinationShort != kCoordinatorShort) {
    return;
  }

  NodeEntry* node = findNodeByShort(macData.sourceShort);
  if (node == nullptr) {
    return;
  }
  node->lastSeenMs = millis();

  ZigbeeNetworkFrame nwk{};
  ZigbeeNwkSecurityHeader security{};
  uint8_t decryptedPayload[127] = {0U};
  uint8_t decryptedPayloadLength = 0U;
  const uint8_t expectedKeySequence =
      (node->currentNetworkKeySequence != 0U) ? node->currentNetworkKeySequence
                                              : g_activeNetworkKeySequence;
  const uint8_t* expectedKey = keyForSequence(expectedKeySequence);
  bool nwkValid = (expectedKey != nullptr) &&
                  ZigbeeSecurity::parseSecuredNwkFrame(
                      macData.payload, macData.payloadLength, expectedKey, &nwk,
                      &security, decryptedPayload, &decryptedPayloadLength);
  if (nwkValid &&
      (!security.valid || security.sourceIeee != node->ieeeAddress ||
       security.keySequence != expectedKeySequence ||
       security.frameCounter <= node->lastInboundSecurityFrameCounter)) {
    return;
  }
  if (!nwkValid) {
    nwkValid =
        ZigbeeCodec::parseNwkFrame(macData.payload, macData.payloadLength, &nwk);
  }
  if (!nwkValid || !nwk.valid || nwk.destinationShort != kCoordinatorShort) {
    return;
  }
  if (security.valid) {
    node->secureNwkSeen = true;
    node->lastInboundSecurityFrameCounter = security.frameCounter;
  }

  if (nwk.frameType == ZigbeeNwkFrameType::kCommand) {
    ZigbeeNwkRejoinRequest rejoinRequest{};
    if (security.valid &&
        ZigbeeCodec::parseNwkRejoinRequestCommand(nwk.payload, nwk.payloadLength,
                                                  &rejoinRequest) &&
        rejoinRequest.valid) {
      handleNwkRejoinRequest(node, rejoinRequest);
      return;
    }

    ZigbeeNwkEndDeviceTimeoutRequest timeoutRequest{};
    if (security.valid &&
        ZigbeeCodec::parseNwkEndDeviceTimeoutRequestCommand(
            nwk.payload, nwk.payloadLength, &timeoutRequest) &&
        timeoutRequest.valid) {
      handleEndDeviceTimeoutRequest(node, timeoutRequest);
      return;
    }
    return;
  }

