lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
void pumpRadio() {
  ZigbeeFrame frame{};
  if (!g_radio.receive(&frame, 5000U, 900000UL)) {
    return;
  }
  processIncomingFrame(frame);
}

}  // namespace

void setup() {
  Serial.begin(115200);
  delay(300);

  Gpio::configure(kPinUserLed, GpioDirection::kOutput, GpioPull::kDisabled);
  Gpio::write(kPinUserLed, true);

  const bool ok = g_radio.begin(kChannel, 8);
  Serial.print("\r\nZigbeeHaCoordinatorJoinDemo start\r\n");
  Serial.print("radio=");
  Serial.print(ok ? "OK" : "FAIL");
  Serial.print(" channel=");
  Serial.print(kChannel);
  Serial.print(" pan=0x");
  Serial.print(kPanId, HEX);
  Serial.print(" extpan=0x");
  Serial.print(static_cast<uint32_t>(kExtendedPanId >> 32U), HEX);
  Serial.print(static_cast<uint32_t>(kExtendedPanId & 0xFFFFFFFFUL), HEX);
  Serial.print(" nwk_seq=");
  Serial.print(g_activeNetworkKeySequence);
  Serial.print("\r\n");
  Serial.print("serial commands: b=beacon l=list p=permit_join x=close_join d=discover i=identify_5s e=identify_discover_attr_ext u=write_identify_5s_undivided j=write_identify_5s_undivided_fail w=write_identify_5s W=write_identify_5s_no_rsp s=identify_query S=identify_stop I=effect_blink R=effect_breathe C=effect_channel v=leave V=leave_rejoin k=key_update t=toggle o=on f=off U=brighter D=dimmer M=mid g=enroll_group O/F/T=group on/off/toggle +/-/m=group level\r\n");
  g_permitJoinEnabled = true;
  g_permitJoinDeadlineMs = millis() + kPermitJoinWindowMs;
}

void loop() {
  handleSerialCommands();
  pumpRadio();

  const uint32_t now = millis();
  if (g_permitJoinEnabled && g_permitJoinDeadlineMs != 0U &&
      static_cast<int32_t>(now - g_permitJoinDeadlineMs) >= 0) {
    g_permitJoinEnabled = false;
    g_permitJoinDeadlineMs = 0U;
    Serial.print("permit_join timeout\r\n");
  }
  if ((now - g_lastBeaconMs) >= 1500U) {
    g_lastBeaconMs = now;
    (void)sendBeacon();
  }
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (!g_nodes[i].used || g_nodes[i].shortAddress == 0U) {
      continue;
    }
    maybeExpirePendingApsAck(&g_nodes[i], now);
  }

  if ((now - g_lastStatusMs) >= 5000U) {
    g_lastStatusMs = now;
    uint8_t joined = 0U;
    uint8_t pending = 0U;
    for (uint8_t i = 0U; i < kMaxNodes; ++i) {
      if (!g_nodes[i].used || g_nodes[i].shortAddress == 0U) {
        continue;
      }
      ++joined;
      if (g_nodes[i].pending.used || g_nodes[i].pendingAssociationResponse ||
          g_nodes[i].pendingTransportKey || g_nodes[i].pendingSecureRejoin ||
          g_nodes[i].pendingSwitchKey ||
          nodeHasPendingApsAck(g_nodes[i])) {
        ++pending;
      }
    }

    Serial.print("alive joined=");
    Serial.print(joined);
    Serial.print(" pending=");
    Serial.print(pending);
    Serial.print(" permit_join=");
    Serial.print(g_permitJoinEnabled ? "open" : "closed");
    Serial.print("\r\n");
    Gpio::toggle(kPinUserLed);
  }
}
